tap "homebrew/cask"
tap "homebrew-ffmpeg/ffmpeg"
tap "petere/postgresql"
tap "cloudflare/cloudflare"
tap "bramstein/webfonttools"
tap "teamookla/speedtest"

cask_args appdir: "~/Applications", require_sha: true

# Core stuff
brew "cask"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "pkg-config"
brew "ca-certificates"
brew "openssl@1.1"

# Core libs
brew "bdw-gc"
brew "gdbm"
brew "gnupg"
brew "gnutls"
brew "guile"
brew "icu4c"
brew "jansson"
brew "jpeg"
brew "krb5"
brew "libunistring"
brew "libevent"
brew "libffi"
brew "libidn2"
brew "libimobiledevice"
brew "libnghttp2"
brew "libpcap"
brew "libtasn1"
brew "libuv"
brew "libyaml"
brew "lz4"
brew "mpdecimal"
brew "nettle"
brew "p11-kit"
brew "sdl2"
brew "xz"

# Langs/ Lang Management/ Runtimes/ Compilers/ Db/ Dbms
brew "gcc"
brew "python3"
brew "go"
brew "nvm"
brew "rust"
brew "cmake"
brew "postgresql@14"
brew "postgis"
brew "rbenv"
brew "sqlite"
brew "glide"

# Media tools
brew "imagemagick" args: ["with-webp"]
brew "youtube-dl"
brew "sdl_image"
brew "media-info"
brew "ffmpeg" args: ["with-libass", "with-libvpx", "with-libvorpis", "with-libsoxr", "with-libbluray"]
brew "xpdf"

# Font utils
brew "woff2"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"

# Networking
brew "c-ares"
brew "openssh"
brew "drill"
brew "unbound"
brew "socat"
brew "aria2"
brew "rsync"
brew "mutt"
brew "siege"
brew "nmap"

# Other CLI Tools
brew "ack"
brew "git"
brew "git-lfs"
brew "jq"
brew "readline"
brew "unrar"
brew "httpie"
brew "yarn"
brew "speedtest"
brew "wget" args: ["with-iri"], restart_service: :changed
brew "archey4"
brew "awscli"
brew "brotli"
brew "vim" args: ["with-override-system-vi"]
brew "grep"
brew "mas"
brew "colordiff"
brew "watchman"
brew "asciinema"

# For fun :3
brew "catimg"
brew "cowsay"
brew "fortune"
brew "sl"
brew "figlet"
